# Data processing with Pandas

In this notebook we are going to cover the following items:

-How to perform datatime management

-How to deal with missing values

-How to concatenate two data frames

-How to add column based on filtering conditions of other existing columns

-How to join two data frames

## Datetime management

In [1]:
import pandas as pd
import numpy as np

Let's first create the data frame with column F contains the date time information.

In [2]:
df=pd.DataFrame({"A":[1,5,10],
                "B":[2,6,11],
                "C":[3,None,12],
                "D":[4,8,None],
                "E":["Y","N","Y"],
                "F":["11/27/2017 17:00:00","11/26/2017 18:00:00","11/25/2017 20:00:00"]})
df

    A   B     C    D  E                    F
0   1   2   3.0  4.0  Y  11/27/2017 17:00:00
1   5   6   NaN  8.0  N  11/26/2017 18:00:00
2  10  11  12.0  NaN  Y  11/25/2017 20:00:00

From the information below column F is not in proper datetime format. 

We need to convert it into the correct date time format with to_datetime method from Pandas.

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 6 columns):
A    3 non-null int64
B    3 non-null int64
C    2 non-null float64
D    2 non-null float64
E    3 non-null object
F    3 non-null object
dtypes: float64(2), int64(2), object(2)
memory usage: 224.0+ bytes

In [4]:
df["F"]=pd.to_datetime(df["F"],format="%m/%d/%Y %H:%M:%S")

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 6 columns):
A    3 non-null int64
B    3 non-null int64
C    2 non-null float64
D    2 non-null float64
E    3 non-null object
F    3 non-null datetime64[ns]
dtypes: datetime64[ns](1), float64(2), int64(2), object(1)
memory usage: 224.0+ bytes

We could also extract the date, the hour and the minute from the datetime object with dt.date,dt.hour and dt.minute respectively.

Example to extract the date from the date time object.

In [9]:
df["G"]=df["F"].dt.date

In [11]:
df["G"]=pd.to_datetime(df["G"],format="%Y-%m-%d")

In [12]:
df.head()

    A   B     C    D  E                   F          G
0   1   2   3.0  4.0  Y 2017-11-27 17:00:00 2017-11-27
1   5   6   NaN  8.0  N 2017-11-26 18:00:00 2017-11-26
2  10  11  12.0  NaN  Y 2017-11-25 20:00:00 2017-11-25

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 7 columns):
A    3 non-null int64
B    3 non-null int64
C    2 non-null float64
D    2 non-null float64
E    3 non-null object
F    3 non-null datetime64[ns]
G    3 non-null datetime64[ns]
dtypes: datetime64[ns](2), float64(2), int64(2), object(1)
memory usage: 248.0+ bytes

## Handle missing values

#### Remove the rows with missing values

In [14]:
df.dropna(axis=0)

   A  B    C    D  E                   F          G
0  1  2  3.0  4.0  Y 2017-11-27 17:00:00 2017-11-27

In [16]:
#Note you need to assign the result to another variable
print(df)
df=df.dropna(axis=0)
df

    A   B     C    D  E                   F          G
0   1   2   3.0  4.0  Y 2017-11-27 17:00:00 2017-11-27
1   5   6   NaN  8.0  N 2017-11-26 18:00:00 2017-11-26
2  10  11  12.0  NaN  Y 2017-11-25 20:00:00 2017-11-25

   A  B    C    D  E                   F          G
0  1  2  3.0  4.0  Y 2017-11-27 17:00:00 2017-11-27

#### Remove the columns with missing values

In [17]:
df=pd.DataFrame({"A":[1,5,10],
                "B":[2,6,11],
                "C":[3,None,12],
                "D":[4,8,None],
                "E":["Y","N","Y"],
                "F":["11/27/2017 17:00:00","11/26/2017 18:00:00","11/25/2017 20:00:00"]})
print(df)
df=df.dropna(axis=1)
df

    A   B     C    D  E                    F
0   1   2   3.0  4.0  Y  11/27/2017 17:00:00
1   5   6   NaN  8.0  N  11/26/2017 18:00:00
2  10  11  12.0  NaN  Y  11/25/2017 20:00:00

    A   B  E                    F
0   1   2  Y  11/27/2017 17:00:00
1   5   6  N  11/26/2017 18:00:00
2  10  11  Y  11/25/2017 20:00:00

## To concactenate two data frames

In [18]:
df1=pd.DataFrame({"Default":["Y","N","N","Y","N"],"Income":[1000,3000,4000,6000,7000]})
print(df1)
df2=pd.DataFrame({"Age":[30,25,40,44,42],"Name":["Peter","Sam","David","Alan","Susan"]})
print(df2)

  Default  Income
0       Y    1000
1       N    3000
2       N    4000
3       Y    6000
4       N    7000
   Age   Name
0   30  Peter
1   25    Sam
2   40  David
3   44   Alan
4   42  Susan

In [19]:
df3=pd.concat([df1,df2],axis=1)
print(df3)

  Default  Income  Age   Name
0       Y    1000   30  Peter
1       N    3000   25    Sam
2       N    4000   40  David
3       Y    6000   44   Alan
4       N    7000   42  Susan

## Add column based on filtering condition of other existing columns

In [20]:
df3=df3[["Default","Name","Income","Age"]]

In [21]:
df3["Age_Group"]=np.where(df3.Age>=40,"M","Y")

In [22]:
df3

  Default   Name  Income  Age Age_Group
0       Y  Peter    1000   30         Y
1       N    Sam    3000   25         Y
2       N  David    4000   40         M
3       Y   Alan    6000   44         M
4       N  Susan    7000   42         M

In [23]:
df3.drop(["Age_Group"],axis=1,inplace=True)

In [24]:
df3

  Default   Name  Income  Age
0       Y  Peter    1000   30
1       N    Sam    3000   25
2       N  David    4000   40
3       Y   Alan    6000   44
4       N  Susan    7000   42

In [25]:
df3["Age_Group"]=["Y" if i<40 else "M" for i in df3.Age ]

In [26]:
df3

  Default   Name  Income  Age Age_Group
0       Y  Peter    1000   30         Y
1       N    Sam    3000   25         Y
2       N  David    4000   40         M
3       Y   Alan    6000   44         M
4       N  Susan    7000   42         M

## To perform joining between data frames

In [27]:
df4=pd.DataFrame({"Name":["Peter","Sam"],"Department":["Engineering","HR"]})
df4

    Name   Department
0  Peter  Engineering
1    Sam           HR

### Left Join

In [28]:
df5=pd.merge(left=df3,right=df4,how="left",left_on="Name",right_on="Name")

In [29]:
df5

  Default   Name  Income  Age Age_Group   Department
0       Y  Peter    1000   30         Y  Engineering
1       N    Sam    3000   25         Y           HR
2       N  David    4000   40         M          NaN
3       Y   Alan    6000   44         M          NaN
4       N  Susan    7000   42         M          NaN

### Inner join

In [30]:
df5=pd.merge(left=df3,right=df4,how="inner",left_on="Name",right_on="Name")

In [31]:
df5

  Default   Name  Income  Age Age_Group   Department
0       Y  Peter    1000   30         Y  Engineering
1       N    Sam    3000   25         Y           HR